[
  {
    "name": "Denis",
    "comment": "Latest version hangs very often and doesnt register taps or user interctions for a minute at a time, maybe even longer... Preferred download location will change from SD Card to internal with updates, so I disabled auto-update. The new tap to jam function only works for a short while with iphones, then seems to get stuck and any action I make wont be sent to the \"master\" iPhone/jam leader. Spotify never seems to ever make one single solid feature...always buggy.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Bablu Panda",
    "comment": "Very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very Good apps I like this apps🤞🤞🤞😊😊😇😇🥰😍😍😇",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mia Ahnen",
    "comment": "Amazing",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mr. Vijay Maurya",
    "comment": "Best Music app 🎶♥️",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "alejandra espinoza",
    "comment": "The best app for listening to music🥰",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Gerhard Putter",
    "comment": "Top notch suggestions, and that hits hard!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "growling growler",
    "comment": "Plays whatever Spotify want to on the FREE version, they try to bully you effectively into paying for a subscription now by repeatedly playing the same advert again and again without variation and by throwing in music they think you may (or probably don't) want to hear. The FREE versions of the app gives you a good idea of the company and where things are going, Spotify used to be great, but first adverts, then removed features, only premium. +i don't think it's value for money comparatively.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Elena Dkhar",
    "comment": "I just hate the new version and most the lyrics cannot be load and too many ad",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Arcris Rocqueta",
    "comment": "Very good",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mahesh Kumar",
    "comment": "This is good!spotify makes me feel very happy..😍",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Hanu Tamut",
    "comment": "Lyrics are mistake in some songs",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Sumit Gupta",
    "comment": "Song in Notification panel is stuck. Song in app is changed but still Notification is there only. Spotify lite and other apps are working fine. If i have to use lite even with a premium subscription then i should rather cancel it",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "BERT",
    "comment": "I liked the app when I first installed it and I'm ok with the ads and all that but not being able to pick the song I want to listen to on my Playlist killed it for me if they change this I would consider reinstalling it",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Khauhelo Mosikili",
    "comment": "The disadvantage of this app is that you can't fast-forward music nor reverse it. I think this app would've been much if a user could fast-forward music or reverse it.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Sanoop",
    "comment": "Worst app ever after the updation this guys totally changed everything we cannot choose a song. Not everyone have money to buy Premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Krishyadavboy Krishyadavboy",
    "comment": "Too much add breaks... U can't even skip the music.... Worst app.... Guys go for wynk music .. beter than this...",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "TrueLiesLost",
    "comment": "New menus are terrible. Download with data setting us in audio quality and it takes 2 screens to subscribe to premium and then the change plan button disappears and you have to navigate through like 5 to unsubscribe.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Зелений Frog",
    "comment": "You can't even listen to a specific song if you have not payed",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "wait start go",
    "comment": "It's good application for songs but after updating very irritating futures not like that Spotify very worst experience please don't download this application my opinion.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "soma sengupta",
    "comment": "It's awesome 😎👍",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "erin wilson-crew",
    "comment": "Ok....Spotify does not know how to actually add new features . It only knows how to stop giving features and get people to buy premium. The fact they kept lyrics of most songs away and are continually putting it behind a pay wall is so....disgusting? You had to take a feature and Rob it from people so you get them to buy premium. Because of my memory issues, I need lyrics to sing my favourite songs, and I don't want to buy premium. Stop stealing features, make new ones.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Y van A.",
    "comment": "2023 Update: They removed the option to just heart a song, now you have to take multiple actions just to like a song, the constant ui updated make this program ever more clunky and are what made me pull the trigger and cancel my subscription. Horrible program with unnecessary updates to keep investors happy.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "AJ Nolan",
    "comment": "Wow used spotify for years its truly amazing have loved using the best streaming music app on the planet",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sahid Hossain",
    "comment": "Listen song ❌ Listen advertisement ✔️",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Katie McGuire",
    "comment": "Randomly stops playing podcasts",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Niharika Singh",
    "comment": "The recent update is so bad like now we can't even listen to a song on loop and playlist will always play on shuffle mode without premium... spotify used to be such a good app with all the features and now it's just super annoying",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Lee Wright",
    "comment": "Love it",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Lucky srivastav",
    "comment": "Bad experience",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Jose Zelaya",
    "comment": "THIS IS MY FAV APP~!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "maria vega",
    "comment": "can't use my phone",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Bio Berni",
    "comment": "Im member pay monthly and have Stupid commercials with Podcasts!!!!... Spotify have lots of issues with the App screen timeout no working anymore for months they dont fix the issues and they Don't care , always a AI answer a robot not humans 😡🤬😡🤬😡!!",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Shadow Pritam",
    "comment": "New update ruined everything 🤧just skip that",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Slay Yars",
    "comment": "I can't even with this app. It's OKAY to listen to music but you have to pay for EVERYTHING. You only get 6 skips... 6 SKIPS?! Unless you wanna pay every month. it's a STUPID MONEY SCEME. and it puts on every song EXCEPT the one I want to listen to on my playlist. and then I use all my skips. Soundcloud, Musi, Audiomack, and YouTube music are all better.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Roberto Garnica",
    "comment": "I use this every day. To the gym, while I study, or while driving. What an incredible application created by humans. Salute to the developers and engineers that work for Spotify, who make this service available.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sukriti Gupta",
    "comment": "Very disappointing not able to login to my account. I am not able to buy subscription on my account then wahta is the point kf a good app if settings are not working properly",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "My Singing Coverist",
    "comment": "This is staying as a 1 star review until you guys stop forcing your app to open itself. I'm switching to Pandora.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Ajit Kumar Maxwell.",
    "comment": "I love its liberity...I should be grateful for your greatness...The New Innovative,Spectacular & After all Significance..Extensively prominent to affirm my consideration.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Shruti Kulkarni",
    "comment": "Nice app 👍👍👍👌👌👌👌👌👌👍👌👍👍👌😘😘😘😘😘💝💝💝💝💝",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Terri Rebisz",
    "comment": "love this app",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Aniket Wathore",
    "comment": "Too much ads",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rafael Husu",
    "comment": "Enjoyable and easy to use and to navigate!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Youngsterbouy Mokgalabone",
    "comment": "I was supposed to give it 5 star but the problem is that it always says i have to get premium what what even though I use my own data",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Onuogu John ekenedirichukwu",
    "comment": "I find all the music I'm looking for here",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "ashley",
    "comment": "bring the heart button back",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Daniel A",
    "comment": "Better then YouTube for music",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Nevaeh Faith",
    "comment": "Listen here this is a pretty good apo it's just if I make a playlist even if it doesn't have enough songs u have no right to add to my playlist it's annoying I try to make a playlist and u add to many songs on there and the ads there's way to many I feel like u need to remove the things off my playlist there should be a setting that doesn't let u add to my playlist thank you.",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Shahnaz begam",
    "comment": "We also learn how to get falling in love",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sudhiksha",
    "comment": "I paid for premium with a limited time discount and it didn't let me move back and forth in the song if I was not in the app, like how badly can you all beg for more money?",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Wila Mina",
    "comment": "Dear Spotify. Please can you put a double like on songs as we relisten through the ages and that will be a double thumbs up x",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Rea",
    "comment": "Cool.🔥🔥",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Pooja Kundu",
    "comment": "The slowest app 😫",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Geo Geo",
    "comment": "جامد",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Aalimsha Hakkim",
    "comment": "😇💫🙏",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Vipul Bidhol",
    "comment": "Uninstall app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Amina Baksh",
    "comment": "everything is premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aarav Jaiswal",
    "comment": "bruh they made it so much worse for free accounts",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rajat Daiwal",
    "comment": ".... Waste",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "roshan Rai",
    "comment": "Same same but difelent no money no Spotify... I just delete....",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Raveendra Sampath",
    "comment": "Woooooooow",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "amberlynn Wells",
    "comment": "Good just as soon as I pick a song it changes to a complete different song",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Thakdanai Ruksrithong",
    "comment": "My media player just bugs I cant rewind music through media bar also cover thumbnail is blurring, and this happened to spotify only.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Seemant Kale",
    "comment": "I hate it sm",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Gelen Sierra",
    "comment": "There's only one thing I don't like and it's the fact that the app closes when the phone it's blocked and I have to play it over and over.",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Melinda Butler",
    "comment": "Good deal.😊💪 for gum.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Nikhil Arya",
    "comment": "Har chij Ke paise",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Brajkishor Yadav",
    "comment": "This app is very successful. I am using this app from 9 months. I didn't feel any issue in this. You can download this app without any problem.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "roshan dhanuk",
    "comment": "Gane to achae hai app par ishi baat ka ghamand hai is Spotify Baleno ko iski bhan ka naman",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Koushik Bauri",
    "comment": "Spotify don't be so greedy there are plenty of music streaming app out there",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "angelxoxo beut",
    "comment": "Best!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Jasen Edralin",
    "comment": "Overall, the app is good. I wish I could customize it to my liking. The service is pretty good. Although, I am disappointed that there are a number of songs that are locked out for reasons unknown to me. I wish I could request songs for Spotify to add to their service.",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Kailash Bhavsar",
    "comment": "Very disturbance by adds interrupting in 2-3 songs",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "MR彡 RAJWANI",
    "comment": "Le re land le ye le teri ek star ⭐ ye le tera app (uninstall) ye le moot dia tere premium plans pe 💦",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Alona Anu Gladson",
    "comment": "Istg... the new update made the app worse...",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Abin Cz",
    "comment": "ad ka baap",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rahul Das",
    "comment": "👍🏻🤍",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Bryan Lowery",
    "comment": "It needs more play-control options during songs and videos. Adjustable 5-10-15 second skipping would be nice too. Needs better/more options for filters when browsing through podcast episodes, besides \"Newest/oldest\" etc. GIVE US ALL THE OPTIONS!!!!",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Yash Jadeja",
    "comment": "Awesome",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "ananya",
    "comment": "capitalism is batshit crazy bcs why are you charging me to listen to my favourite song??",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "nandkumar dachawar",
    "comment": "Good",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Jason Oaken",
    "comment": "Used to be good, but now even with premium they're pushing ads in your face. Cancelled my membership and won't be coming back.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Lavi Baliyan",
    "comment": "This is the worst app ever. I used to love it once. But now for every single thing they need money....do these developers or whoever they r really think this is the only option we have.....",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aritra Basak",
    "comment": "Music control in notification pannel is not working properly. Its not showing the correct song currently playing and its all blurry and full of glitch. Please fix it.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Misbah Ansari",
    "comment": "Just a little problem with the ads and shuffle stuff....rest is okay Some songs do not show lyricz Hate that....",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Harish Gowda Suresh",
    "comment": "Dabba app ever seen You can't forword the song or revind And can't play in our order also The worst app update ever seen",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "BABLOO YADAV",
    "comment": "Every time it demands for premium without primium dont work Very 😞",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Dharavathu Nagamani",
    "comment": "Worst app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Divas Kumar Ray",
    "comment": "Jay Ma Bhadrakali",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Matt O",
    "comment": "The latest update is too buggy and android auto lists all my spotify playlists as \"no items\" after a long trial and error i just found out that the latest spotify \"update\" is the cause of this issue. Besides this the app has a tendency to randomly disconnect from the internet and stop playing music. There needs to be an immediate fix to both these issues, primarily the Android auto one because I do not want to look at my phone while driving.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "NexApex",
    "comment": "Fkn worst",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "David Coon",
    "comment": "What's not to love about Spotify?And how much do I really love Spotify? Let me count the ways: This is simply the best & only music format app you will ever need. From a personal standpoint every band, group or musician I have ever looked up or typed in has been found right here on Spotify &I listen to some pretty obscure, left of center and hard to find material, plus all genres are represented. And I really enjoy the Playlists & Podcasts and with that here's 5 well deserved Stars.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Berkay Boz (berkayb8z)",
    "comment": "At first, I couldn't listen to any video podcasts. Now, I can't even toggle the on/off for the Canvas button. As times goes on I'm losing every feature of Spotify which makes me really not want to use this app anymore... It has the most recent update, I have enough space in my phone and I did re-downloaded the app at least 10 times + refreshed all remaning data in my phone. Nothing works.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Aabha Chavan",
    "comment": "Too many ads. like after every one song there are 2 ads that to of 90 sec",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Binoy K",
    "comment": "Money hunter oneday your business will fall down",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Dipanshu Vishawakarma",
    "comment": "Good aap",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Anjali Singh",
    "comment": "It's just worst . After the update , it sticks a lot . Sometimes it doesn't allows me to change my profile . And I can't even move my songs(to and fro). Always pressurize me to take premium which is most annoying. I'm uninstalling it rn.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Esther Omidiran",
    "comment": "My go-to depression medicine",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Harshmeet Kaur",
    "comment": "this app is just loosing its own customers due to the features it ain't giving for free. Spotify your downfall is visible",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Danny",
    "comment": "I have a premium Subscription and I only have one complaint. Every time I reopen the app after going on another it just starts playing a random song even if its already playing music and sometimes it just gets rid of my queue for no reason. These are technical issues that need to be addressed because its impacting the quality of the app.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Ethan Cluff",
    "comment": "The best selection. Love the download options",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sandip Ruidas",
    "comment": "This app for rich people...",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Chitrakshi Kaur",
    "comment": "Omg what the hell is wrong with you all. I opened my Playlist that i usually listen, it says go to home to find the song your liking . I am at home already where the hell u want me to go. I have so many liked songs, it says your liked song will be saved here. What the hell??. I mean past update were not bad enough for you that you did this. How am i suppose to listen any song when there is nothing, I MEAN NOTHING that i can see in the Playlist. I was bearing with the old update and now this 🙄🤷",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "taufeeque shaikh",
    "comment": "best",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "James Mackintosh",
    "comment": "Latest updated (3/6/24) broke Bluetooth compatibility- won't display titles on other devices (car stereo) and will show wrong media on lock screen widget now.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "kayden",
    "comment": "mata duitan lol",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Farah Farah",
    "comment": "Wow this is amazing app",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mufees Ahmad",
    "comment": "If Iphone owns apple music.. For samsung none other than spotify and other android devices.. No comparison with other players... Buy premium to enjoy fully rather than complaining about the Ad version...",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Jeremiah Benson",
    "comment": "music keeps pausing without even touching the screen",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Adhu Adhu",
    "comment": "****💩",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Umesh yadav Unnao",
    "comment": "worst experience",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Hiren Sadiya",
    "comment": "Free version experience of spotify is like hell, you are not allowing user to play the song that they wish to play. And ads are there after every 1,2 song.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Joan Jesmer",
    "comment": "To keep my listening experience simple, WOW.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Nevaeh Nash",
    "comment": "I love how we can leave the app and the music is still playing!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Collin",
    "comment": "I like Spotify, but it seems that they love to make changes that negatively affect the app for no reason, such as, rebranding the like button.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Daniel Woods",
    "comment": "Indispensable",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "K .NARESH",
    "comment": "Don't purchase premium on Spotify evey the song can't play in background while playing games worst music app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sandhya Ekka",
    "comment": "Just useless after update 👎",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Vijayalakshmi Errala",
    "comment": "This is the worst app ever. I can't use my phone number to continue. I don't have any other option except phone number. Like how many phones do you want me to have!?!?",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Anshu Kumar",
    "comment": "Bhai download mat Karo abb free nhi raha ye bhi premium maang Raha hai",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sagarika Deb",
    "comment": "Fine",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Tapash Paul",
    "comment": "So bad....",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Ivan Raphael Laxa",
    "comment": "Got my culture back! Perfect companion music on the go app!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Biji Ponnachan",
    "comment": "Good app but after some months I can't get the lyrics of songs",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "rajitha priyan",
    "comment": "It's very good app",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Guillermo Ramirez",
    "comment": "Awesome always on SPOT!!! All the music I enjoy and love at the top of a finger",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Shipra Ghosh",
    "comment": "So cute 💕 song",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Varun Sharma",
    "comment": "Great 😊",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Dexter Nathan-Thomas",
    "comment": "Good but way to many ads, it says 30 minutes but its not like every couple songs, but overall very good",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Akash Mishra",
    "comment": "Want Hi-Res audio in India.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Mohan Subhash.t",
    "comment": "all the reviews who gave only one r two stars is the reason",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Matt Barnes",
    "comment": "Spotify platforms racist, sexist, bigots who deny science. Do not use. App so loaded down with BS it won't load half the time",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Longlife Epiphany",
    "comment": "Best music app ever",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Arun Explorer",
    "comment": "I can't even play in-between",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rudranil Mohanta",
    "comment": "Initially the app is good but day by day it has become a trash. We can't even play the song we want to hear. Earlier the songs suffle continuously then after 6 songs and now it's even more than 6. We can't move to other song untill the ongoing song is over. Everyone is not able to explore premium. This is the worst app to me. I just can't put up with this trash. 😡😡",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aaron Dsouza",
    "comment": "Ok",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Deven Chouhan",
    "comment": "badboyshah ❤",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Shubham Done",
    "comment": "Wrost App",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Joanna Bragg",
    "comment": "Somehow I can't play any of my lists, nor the songs on the lists. I'd push the play button, but nothing happens. Along with it saying something along the lines of \"you're on premium mode\" which I didn't change anything. I'm using the \"free\" mode and happy to not pay for music.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Kunal Khichar",
    "comment": "Absolute trash 🗑",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Renee Reed",
    "comment": "It's good",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Pritam Das",
    "comment": "Worst app....",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Hendries Hendries",
    "comment": "Very poor",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Palak Gupta",
    "comment": "(The wrost music app ever )Why?? the repeat mode was off and now the spotify is taking more net while playing the song, repeat mode is best whenever, the net is off , it works , And why ?? the we have a limited time to listen the songs , in spotify. This all problems start from while the purchasing of membership ,only who, purchase the membership , And those who don't want the membership spotify is wrost for that person. (I am very unhappy with this all new and unwanted features).",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Joshwa Crasta",
    "comment": "I have a premium account and the song shuffle is soo bad, everytime a play a song from search the same songs are repeated in the queue, I want that to change and the playback notification does not appear and I have to open the app to change songs which is soo annoying",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Shlok Gautam",
    "comment": "Worst app....no control over music plus you can't control music",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "FAHEEZ AKINTOYE",
    "comment": "I love it there, it's like a home",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Esen Dogan",
    "comment": "It started crashing my phone completely when I start the app. The screen goes completely black and I have to restart the phone using the side buttons to recover.. happening since a week or maybe two.. how come? Edit after getting a response: Hey it's better than having no response but how about your customer service also keeps an eye on here? You literally are asking a customer, a money source, to do more work than already having explained a problem about the app in this channel for improvement.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Cayden",
    "comment": "Spotify is 5gb yet it's still laggy on my 6gb ram phone. What a joke.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Rushil Gohel",
    "comment": "Worst app Don't install this app I recommend to all Lost of ads interpreted And you don't skip and don't next play song after when you purchase this app plan.. Worst app bakwas app hai Mat karna koi download",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Abhitha Abhithamohan",
    "comment": "Excellent",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "saddaf hussen",
    "comment": "It plays more add than songs, hence it is useless.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "David Wood",
    "comment": "not bad",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Gospel Odokwo",
    "comment": "This app was one of my best for my music exoerience but after the update I don't understand while it takes to long to load up a song or an abulm even though I am using premium please fix this.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Angel Padilla",
    "comment": "Bad",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Darrein jamal Morris",
    "comment": "I love it",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Jordan Saya",
    "comment": "Notification widget song title is broken, it gets stuck on one song and the seekbar doesn't work. Please fix it 🙏🏻 thanks.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Cassandra Ibarra",
    "comment": "Im using wifi and i got good connection but when i use spotify it tells me \"no internet connection \" or it says \" you descovred prenium\"",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Meghana Parida",
    "comment": "YOU CAME HERE TO LISTEN TO SONGS?? HAHAHA WHAT A JOKE! THIS APP DID NOT ALLOW TO REWIND OR FORWARD SONGS AND SHUFFLED MUSIC FOR YOU, THAT MEANS WHEN YOU FINISH A SONG IT DOESNT REPLAY IT BUT PUTS A RANDOM SONG IN EXCHANGE, AND ITS PERMANENT, YOU CANT STOP IT, EVEN IN A PLAYLIST THAT DUMB SHUFFLE STILL EXISTS U CANT EVEN PLAY SONGS IN A ORDER? I TOLERATED IT FOR A BIT BUT GUESS WHAT? THIS DUMB APP INTRODUCED ANOTHER UPDATE IN WHICH YOU CANTCHOOSE UR SONG U SELECT A SONGAND IT REFUSES TO PLAY IT",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Tina Purple Army",
    "comment": "Why this app is so hard to use?! I can't change the songs the way I want and it's making me tired! One day I opened Spotify and saw that my Playlist is gone! And now.. I have to pay money so I can listen to my song!",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sergej Videnov",
    "comment": "It is so good but this new update is little confusing",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Chelsea Anthony!",
    "comment": "This is to much for everything u need premium which is not fair!!ughh i hate this app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Pamela Stager",
    "comment": "Spotify makes work go by so much faster. Love it",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Paul Schirmer Jr",
    "comment": "Best Music App Hands Down!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Dhruv Dholariya",
    "comment": "Best application for me",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Gokul Deepika",
    "comment": "Not worthy🤮🤮🤮🤮🤮",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Gokul Gour",
    "comment": "My favorite song aap love you",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Stelios Fanourakis",
    "comment": "messed up bluetooth and AA... Please update and fix bugs",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "gomathi tws",
    "comment": "I cannot hear my fav part of the song .it's full of waste",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Vishva C M",
    "comment": "VishvaCM",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Dakota Johnson",
    "comment": "Absolutely horrible, better on PC. On phone you only got 5 free skips, and everything is locked behind premium. You can't even choose which songs in a playlist to listen to.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Ujala Pandey",
    "comment": "Quality got down",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Antony Munene",
    "comment": "Good.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Soman",
    "comment": "Superb but some minor issues😩😫",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Maimoona Ummer",
    "comment": "Great app for listening to music 🎵🎵",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "SARTHAJ IBRAHIM",
    "comment": "So many adds,iam very tired 😫😫",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Papi Time",
    "comment": "Always getting the best play list",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Takhai Watson",
    "comment": "not to bad",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Bipul Patel",
    "comment": "Bad app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Michelle Werts",
    "comment": "Always my go to for music! I just learned audio books are on here too. It's really become my one stop shop for all things audio! Podcasts, books and more.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Nitin Patil",
    "comment": "Worst",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Devansh Sharma",
    "comment": "Worst app for song and best for 'Advertisement'",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Nisha",
    "comment": "Too many glitches.... The music stops at any instant, hv to restart the app everytime,and many more such issues.... It's only with this app, the other music apps are working.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "B P",
    "comment": "This was installed as bloatware and the company is too greedy. Uninstalling.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Syifra",
    "comment": "i'm not see any lyrics in the song i need to hear.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Aiden Perez",
    "comment": "Best",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Adolf Hitler",
    "comment": "Plz Rwmove Jewish Song",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "cute devil",
    "comment": "You give the ad for 30 min free music, then after 10 min,another ad came, whats the point of so many ads, just don't tell anything",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Om Shrivastav",
    "comment": "Too much advertisement nonsense app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Ridhul Dilip",
    "comment": "Good on Desktop, Bad on Mobile..",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Krishna Minj",
    "comment": "I love gun gun",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Tyler Larson",
    "comment": "As of late, if I push pause for more than 5 minutes, it won't let me go back and play again. Just seems like a buffer issue. To fix it, I have to go into the app settings, force stop the app and then open it again for it to work properly.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Adam Switzer",
    "comment": "App not working! Keeps telling me my email and password incorrect. When I try to change password it won't let me!! I uninstalled the app and installed it again repeatedly and same results! I had my phone checked and they said my phone not the issue! Please fix the app!!",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "SHOBANA K",
    "comment": "Good app",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sharma Cheshta",
    "comment": "earlier it's too good now we can't even play the the song by searching more than 5 time which is worst part we can't play the music we want to listen",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Arastu Thapar",
    "comment": "Free, easy, fun!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Aniket Deshmukh",
    "comment": "spotify is forcing for purchase premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Jerome legaspi",
    "comment": "Best music App in the world... I bet you'll love every experience you encounter with the app.... Its how it tells how the dj tells how it you feel and gives a suitable music for your mood... ❤️❤️❤️",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Joan Miessi",
    "comment": "I have so many CDs and no more space. Spotify has solved that issue for and what a choice of music! I love that I can sample so much and increase my music library from all genres!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Hansika Reddy",
    "comment": "Pay to listen app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "erick mercado",
    "comment": "Love this app",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Andy Lu",
    "comment": "No way to filter out songs from queue (eg. no lyrics, accoustic, in a different language, etc.); maybe just me but feels weird listening to different types. Many menu options still work offline but app still tries to connect and take a long time to show. Horizontal scroll position isn't saved so you have to scroll everytime you back out from something (eg. album, radio, etc.). Manually playing a playlist doesn't override your queue. Songs don't stay hidden across playlists.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Asmita A R",
    "comment": "Pay pay pay",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "stfusweety",
    "comment": "The new updates are trash",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Landrew Hallstrom",
    "comment": "5 stars for Music/Podcasts. 1 Star for The Audiobook listening cap of 15hrs, ridiculous. No warning and now I have to wait 24 days to finish my book or pay for the top off which costs as much as another audiobook streaming service. For the premium membership this cap should be 50hrs minimum. If you want 5 star rating back change this. I listen at work in the background, I dont wanna pay extra for something I'm mentally 50% engaged with while multitasking.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Nikhil Tomar",
    "comment": "In everything they need premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Naitik Birare",
    "comment": "TOO BAD!😡 JUST TAKING SUBSCRIPTION FOR 1 SONG ! ONLY FIX THE ADS & SUBSCRIPTION",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "N L",
    "comment": "Consistently crashes while I'm streaming at the gym, with either wifi or cell service.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Rinki Pal",
    "comment": "My experience is so bad on this App . Now it's became worse.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "RAHUL CHAUHAN",
    "comment": "borring music app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "ᏟᎻᎻᎬͲᎬΝメ ՏᎻᎬᎡᏢᎪꔪ",
    "comment": "Can't download songs and listen during off-line",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Surendra Singh",
    "comment": "It Is a very bad app ....",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "NIRANJAN JAYARAM",
    "comment": "App is just a trash, ad interrupted",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Connor H.",
    "comment": "You can't listen to an individual song without paying. They already have huge amounts of ads and they restrict you as much as possible. They also say you can listen to 30 minutes after the ads, and that is a lie. You get 10 minutes most of the time. don't want to deal with it anymore. Update 03-14-2024: I re downloaded to see if they had fixed the ads playing after every 10 minutes. They have changed it to ads after 2 songs amounting to 7 minutes and 41 seconds worth of music. Dissapointed",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Anabel Martes",
    "comment": "Love this ap",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "OJAKA JOEL JOSEPH",
    "comment": "This app works for me , I decided to give it my best, I mean a five star",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Tyswid",
    "comment": "Does not load like songs on Android auto anymore",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aftab Alam",
    "comment": "Like",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Joseph Aylward",
    "comment": "Paid for a membership I couldn't access. App is a scam",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Tomejk",
    "comment": "Thanks for the help, my problem fixed",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mohamed Minhaal",
    "comment": "The best music ever 🤩🤩🤩🤩🤩🤩",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Derek Smith",
    "comment": "When I open the app to continue playing a podcast nothing happens; have to force stop the app to get it to work. Also no lossless music.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rasmita Devi",
    "comment": "What's wrong with this app this is very bad when I install this app it was going very well but after few months when I open it was automatically logout I was literally trying since morning but it's not logging in and please fix this problem immediately I want to listen music but I am not able to because of this problem so please please I request you fix this app right now please spotify please and I have uninstall this app 3 times but it's not happening anything I am trying again and again pls",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "X3_PRADEA CINDY LAURA DEVI",
    "comment": "⭐⭐⭐⭐⭐",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Rahul Nitro",
    "comment": "It used to be a good app but now it's the worst. there are so many things you can't do if you are not a premium user. you can't even skip the songs you don't like and you can't even play any random song while playing another song , totally trash !!",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "EVERBRITE",
    "comment": "Horrible experience",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Pratyush Tisha johari",
    "comment": "This app is a good app for listenning songs",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Stcarlson",
    "comment": "Forced to listen to ad after every song, random horrible songs that you don't enjoy \"recommended\" in the playlist, and unable to rewind. Non-premium user experiences are terrible.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Tjoa Tjoadev",
    "comment": "Is Spotify having problems ? I've paid premium per week on Spotify, but there are still ads. and for example, I opened the song Love Story - Taylor Swift, but what came out on the screen was not a Taylor Swift song. Is there a problem with Spotify?",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Mumbai Realty",
    "comment": "Its provide hight quality sound and streaming",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Siddhram Meena",
    "comment": "This music app is a total trash. You can't even play your favourite music and can't even play the favourite part of the song You first have to buy premium and then you can enjoy this app. Every time you open it, first get an ad then listen music. Can't even play our favourite music and that's most annoying thing. This app is not even worth a single star . This app can't even show lyrics to some songs Don't install it if you don't have plans to buy premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Ola Andrzejewska",
    "comment": "Super, polecam",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Scott McAllister",
    "comment": "Would give it the extra star if you bring back the heart instead of the plus icon, other then that works fantastically, really good for roadtrips when you have premium.",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Ryan Calderon",
    "comment": "The latest update sucks. On my media output bar where it shows the song on my lock screen where I can pause/rewind doesn't work or show that option and when I re install the app it works but then when I change the song it still shows the old song playing? And then it eventually won't show at all.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "manish shukla",
    "comment": "WORST VERSION OF UPDATE SINCE AM USING IT........ 📵📵",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Josh Doppler",
    "comment": "The music controller doesn't show up on the lock screen anymore. Why?",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Bishal Kumar Rout",
    "comment": "Bokachoda app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aditya Salkar",
    "comment": "Spotify is so specific app and all songs in there ....",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "28 Sadik Khan",
    "comment": "Mashallah bht acha app h naat Shareef bht pyari bajti v h or battery v khtm ni hoti",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Subhasish Dutta",
    "comment": "I like it",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sinazo Nzanze",
    "comment": "my experience is nice and i can even get songs from the 90's",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Kamla",
    "comment": "Bakwaas",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Pooja Mordani",
    "comment": "Used to be able to forward or go back on a song from my lock screen during the song playing. Or even from the drop-down menu. That option is no longer there. Heavily inconvenient to keep having to unlock my phone to go back a few verses. Bring back that feature.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "shruti bhurke",
    "comment": "How to activate free subscription through activation code",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "laughter",
    "comment": "They just want you to subscribe to premium . In new update users are enable to play song of there own choice and can not even do forward and backward the song . Worst app going to delete it now at the moment",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Abu Hurairah",
    "comment": "Why there is no zero rating option 😡?? i would like to give 0 rating",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Neville Hove",
    "comment": "The best music app by far.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Ok Ok",
    "comment": "You just bring down the community and make it difficult for the users instead of pleasing the users because you don't allow the users to choose the songs they want by adding an all in one playlist",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Harshit Jaiswal",
    "comment": "Worse app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Tejuswin edakkat",
    "comment": "Useless",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sambhu nath Mukherjee",
    "comment": "The app is amazing.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Brian Kibe",
    "comment": "Dope",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Katie Thompson",
    "comment": "Wish they'd change how the \"plus\" function saves and unsaves songs. While I like how it gives you the option to manually remove songs from different playlists/music library while in the app, the plus function is easy to press accidentally while skipping through songs in the notification bar, and it will instantly remove that song from your library if pressed. This is annoying and makes it so that I have to resave songs and affects the original month/year a song was saved.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Nate Paschal (Nate)",
    "comment": "Autoplays songs you don't want. Plays Kidz Bop and The Duck Song if you're lucky. Plays uncensored YG when I'm giving my boss a lift and I start my car. I want to choose when songs play with no autoplay. Why isn't that an option? Just let us play the music we want when we want to, and it will be a good app. (Premium Sub)",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "K",
    "comment": "Why giving so much money only for listening for 2 or 5 songs each day?",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Everet Ngomango",
    "comment": "Legit",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Lisa basumatary",
    "comment": "I have been using spotify for years.... but the recent updates are just too much you can't even use rhe basic options ... its basically forcing you to take premium... I mean like even listening to a specific part is also not available....it won't long before I delete this app for sure",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Oakley Moore",
    "comment": "I love music so much",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Alix “Tattoo Alix”",
    "comment": "New app layout is not enjoyable. There should be an option to have \"classic\" view, or the new much more awful one.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Ahmad Abiyu",
    "comment": "Udah beli premium tapi kalo dengerin di laptop masi ada iklan, padahal akunnya sama sampe beli 2 kali masi ada iklan",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Vaishali Meshram",
    "comment": "Ksk hd bxks. Discus so s so did scans slacks or a little while ago but I'm sure it would be nice for me and the rest is 👆 with the 👪 room for you to know if I could be the same as before and it has to work tomorrow 🌃 and the rest of your friends are the only person in my car to go back home and get it to the hospital with her to be 60s the best in my car and the girls were in my life to make sure that you don't want me to do that too much fun 60s the same you Ha you are a little while to Repl",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Azat",
    "comment": "When I open links in Spotify app nothing happens",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Dean Vinroe",
    "comment": "Thee best in the land",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Massimo Fruck",
    "comment": "I have premium version. It's so buggy. First time u hit the search bar you have about 5 seconds before it takes the keyboard away and you click on the wrong thing and have to start over again. It never plays in my car on its own even though the setting is on. I always have to turn off wifi, and open the app before i start car. Then hit play on phone. Example scenario. Listening to podcast A and get home. Next day open app like above and it doesnt say anything playing and i have to queue again",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Kristiejo Henderson",
    "comment": "love it.. can find all my favorite music and my daughters.. every day is a spotify day...",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Aditya Yadav",
    "comment": "Full of ads🤡",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Steve Joe (Zany Storm)",
    "comment": "Sasa kiwete asiposkia la mkuu ni nini itamfanyikia 😂😂🚶",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Maninder Singh",
    "comment": "This app give more ads so can't Tollereat",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "M",
    "comment": "I like but it crashes at least once a week. generally when I put are on. the app starts freezing so you can't control it from Bluetooth. unistalling it is the only way to fix",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Jacob Trichell",
    "comment": "The app is pretty good but I don't like how if a Playlist has under an hour worth of songs random songs that I didn't add get added. The playlists I make are for songs I like not for random songs to be added to them.",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "Kyle Bruce",
    "comment": "... .7 I I I I you ple4ase let#454",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Tanish Kumar",
    "comment": "Ads are between the songs and now I can't even like or dislike any song.... Switching to YT Music",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "NAMAN MAKKAR",
    "comment": "👎🏻",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Munna Thapa",
    "comment": "Wow",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Shanice Jantjies",
    "comment": "Starting to get us to buy premium I don't like that but pretty good elsewhere",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "SAM I AM I AM SAM",
    "comment": "Better than pandora",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Đặng Hiếu (Ngộ Tuệ Việt)",
    "comment": "User Interface is not as good as it was (for example, some songs displayed as not downloaded though I downloaded them all). Music's quality is awesome, app is smooth. Overall, Spotify is great ❤️",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "John Rio",
    "comment": "Very useful",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "jsqueaky7 ash",
    "comment": "I can find any song I love, I don't have any problem playing songs! I love Spotify!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Chamkaur Singh",
    "comment": "Badapp😈😈😈😈😈😈😈😈😈😈😈😈😈😈😈😈😈😈👿👿👿👿👿👿",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Normallia Norkamal",
    "comment": "Israhell!!!",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Shadow GAMER",
    "comment": "This is the worst app in all of history. This is more money hungry than EA. I can't even play the song I want without premium. I tried playing kickback and it started playing some random song. Please Spotify return to your old self",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Md islam",
    "comment": "Shundor",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Madhumithra Shivasurya",
    "comment": "I can't keep song I like and can't listen to specific part of song and I can't listen the song in order from my like list. Then it is playing other than my like list, please fix the problem At 1st it was good but not now",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Jay Murrugan",
    "comment": "The player is not changing to currently playing song. Ex : I'm playing \"without me\", but in the player bar showing another song.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Breon Banks",
    "comment": "It's so buggy and choppy when listening to podcasts even on wifi, you can barely understand what the person is saying, it'll be 5 stars if I was able to listen to something without it stopping every 3 seconds and no I have a great phone connection it's not that",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "PRIYANSHU VERMA",
    "comment": "I'm surprised!! This app has a 2.4 star rating! I was expecting even lower that 1",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rocky Gonzales",
    "comment": "Love this app!",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Miss Hibiscus",
    "comment": "Not a fan of the desktop update that brings up the queue on the right side of the screen. I prefer lrednitnwhen it would show up on the full screen.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Sathish kumar",
    "comment": "very nice",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Uttam Mondal",
    "comment": "হেভি ভালো App এত ভালো অ্যাপ আমি কোন দিন দেখিনি",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Gulshan Singh",
    "comment": "it's irritating we can't skip the song it's say buy a premium subscription",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Chhavi Mahajan",
    "comment": "Worst app ever🤢🤮",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Lisa Woods",
    "comment": "Have no words just Spotify is perfect",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Swa rvy",
    "comment": "Worst music player",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Darshan Rathi",
    "comment": "I used to enjoy Spotify application. But, now the new update is worst... Premium is important I agree, Some features needs to be added in premium...F 1. We cannot listen in sequence...coolll 2. There are no lyrics...also cool... 3. Now new update \"We cannot listen to the song which we want to\" Lol...next level degrade... Fan of Spotify Music quality but this update wow... Now Spotify feels like a irritating application...where i cannot even listen to any of my song... Wtffff...skips? Lol worst!",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Jaya Bhardwaj",
    "comment": "Very good आप",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Manilal Adhikari",
    "comment": "LOVE THIS APPLICATION.😇🤗",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Puran Srestha",
    "comment": "Nice",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "T M",
    "comment": "savvy",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Indira chavariya Indira chavariya",
    "comment": "World best songs app👍",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Guillaume Klz",
    "comment": "I don't know which update is in cause, but lately when my cellphone is locked, before unlocking it I could see the spotify features showing the song playing and I could pause or switch the the next or previous. Now i have to unlock my phone and go to the app. Bring that back please",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Kyle",
    "comment": "There is no actual shuffle feature. Seems like they funnel you towards content that they make more revenue from. Frustrating when you pay for basic features and they don't exist.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "PROSCON",
    "comment": "These people think that they've secured their spot in the system and now they just don't give a damn about their free users",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Elizabeth Loviska",
    "comment": "This app is slowly getting worse. Smart shuffle sucks and its a pain to get shuffle to turn completely off. Whenever I find a song in shuffle and want to listen to the song that would be next without shuffle- I can't just turn it off anymore and continue from that point in my Playlist, it starts from the beginning which sucks because I have over 2k songs liked in there. It recently has had a lot of trouble loading in general on top of the new features.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Erin Stretch",
    "comment": "I have been using this app for podcasts. But sometimes the podcast just stops playing and I have to close and reload the app. Please fix this problem.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "rekha goel",
    "comment": "horrible. was making a playlist and it kept freezing and turning off even in paid version",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Hannah E Edmonds",
    "comment": "Repeatedly goes silent.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Sean Roufosse",
    "comment": "Great but a lite version for slower phones would be great",
    "rate": "4",
    "date": "March 14, 2024"
  },
  {
    "name": "WitchingHour",
    "comment": "For me even making a playlist on the regular YouTube app is a better option over Spotify, without paying for premium you can only have 6 skips per hour, after a while you can't even tap on the song you want to play, it has a 30 second ad almost every song, everything is locked on shuffle and it adds random suggested songs to your playlists, and you can't rewind to earlier in the song, it also takes forever to load anything. Wouldn't recommend for people who don't want to pay",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Dhruv Vashisht",
    "comment": "Very buggy app low quality stuff. Inspite of being a premium customer have to suffer through this nonsense. To people who read this comment pls don't use Spotify use another app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Charalampos Koundourakis",
    "comment": "For some reason consumes my battery and phone cpu like crazy, basically causes lag and halves my battery life.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Liane Van Niekerk",
    "comment": "This is a great app recommend to use this app you can even listen chipi chipi Chapa Chapa Rubi Rubi raba raba so it is definitely recommended",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Lakshay Dhiman",
    "comment": "Dear Spotify team, I can't seek forward or backward my song even after having premium, my slider in notification center is not working, I want a solution to this problem otherwise I'll be cancelling my premium subscription.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Rahul Kamra",
    "comment": "You Have To Pay For Almost Everything...",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Asher Faktor",
    "comment": "The latest update has so many glitches and bugs. For example; when a song is playing, spotify shows a different song in Notification bar and lock screen. I tried to clear cache, clear data, uninstall and then reinstall Spotify, and finally, I tried a clean reinstall. Nothing worked. I tried to force stop spotify and then open it bud it only helped for a few minutes. I am disappointed by what has become of Spotify.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "Odi Siram",
    "comment": "very bad",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Terry Owens",
    "comment": "There's no way to resume a podcast midway through the episode after listening to music.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Corrine Pretorius",
    "comment": "Brilliant",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Anjolaoluwa Falade",
    "comment": "Perfect...",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Nisarg Nik",
    "comment": "Excellent sound quality.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "marcel uter",
    "comment": "Works as described.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Sreya Sajeev K",
    "comment": "Wo good",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Harshita Rajwade",
    "comment": "Best Music platform ever",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "ThisDogeCool",
    "comment": "Just why. I can only play songs with limit. What a downgrade! Literally like this app forced me to buy premium",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Soumobrata Ghosh",
    "comment": "Trash app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "MAHI INTERPRISES",
    "comment": "This app is not working not sign-up and ect things",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Joanne Hayward",
    "comment": "Love the variety",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Dhenis Bronia",
    "comment": "I hate it... because of ad👿👿👿👿👿",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "chris smith",
    "comment": "Getting better but still a bunch of weird/frustrating bugs. The queue gets stuck and pressing the play button on a radio station or playlist just continues playing the queue already loaded. These kind of bugs keep me looking for alternative music services.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Sagnik Halder",
    "comment": "Worst app! Literally garbage! You guys are seriously begging... Who would say it was one of the best app before? Complete disappointment",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "CHOCOLATE BOY 007",
    "comment": "Bycout app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Aakangsu Singh",
    "comment": "Even asking for premium for playing a song,worst app",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Valkyrie Stik",
    "comment": "Honestly, YouTube music is better, why?.. WELL, SPOTIFY JUST WONT LET ME LOGIN!, and whenever I reinstall and try to login again, it says \"something went wrong, try again\" I'm honestly not happy with this Spotify experience.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Mario Reyes",
    "comment": "Ive never had problems with spotify, it was always consistent when it came to literally just playing music. NOW, it takes 1-3 seconds to play a song after tapping it, which might not seem like much but over time it adds up to the point where its a nuisance. Its a great app, always been my go-to, but if a simple thing such as playing music starts lagging behind, its not acceptable",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Edward Mik",
    "comment": "The sound is poor quality and won't let me play my playlist in order and I have to buy premium just so I can go back and listen to my songs",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Wiljam",
    "comment": "I have been a long time user of premium, but I recently cancelled my plan. I have to say that I have never used an app that is this hidious and literally doesn't give you an option of paying for premium, if you actually want to use it for anything. Not user friendly and absolutely only a desperate money grab with forced premium. Anti-consumer practices in a nutshell.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Malkeet Khan",
    "comment": "I like the app bla bla blahhh",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Rinku Sharma",
    "comment": "Worst app ever don't download it you will only regret like me I must recommend you YT MUSIC it's ♾️× better then this trash !",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sameer Sawant",
    "comment": "Nice app...",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "OPSV",
    "comment": "Apps become practically unusable for free users, can't go to certain points of a song, can't replay a song, can't listen to am album in order. Free users can't even use the app anymore",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "38 Disha Naik",
    "comment": "I can't see the lyrics of many songs and I hate it, Now you can't even choose the song you the song you like,it's annoying.",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Gopal Jajra",
    "comment": "Good play",
    "rate": "3",
    "date": "March 14, 2024"
  },
  {
    "name": "Sierra Seabolt",
    "comment": "App is great for providing the entertainment however their app sucks due to bugs that often cause the app to pause for no reason when playing. If I get one more lame half assed \"reinstall the app\" response I'm gonna scream. Are you people that uncommitted to helping individuals that you think I didn't already try that.",
    "rate": "2",
    "date": "March 14, 2024"
  },
  {
    "name": "# SCOUT",
    "comment": "This app is very worst and skip and login problem 😡😡",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Adam Ridley",
    "comment": "Always improving! 10 plus years and counting for me 👌",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Dharshini Jayaraman",
    "comment": "New update is trash I don't recommend this to anyone anymore.",
    "rate": "1",
    "date": "March 14, 2024"
  },
  {
    "name": "Sheila Oswald",
    "comment": "Learning about my cell and how to work it still. Don't know how to do alot of stuff.",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mahesh Kadam",
    "comment": "this music appv is osam",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Mubeen Shah",
    "comment": "Andar dal Kay mazay lo . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ... Pocket ma mobile music enjoy kro",
    "rate": "5",
    "date": "March 14, 2024"
  },
  {
    "name": "Alex R",
    "comment": "I love Spotify, but this app on my android is busted. The touch is so delayed and half the time the audio titles don't display on my devices, this has been a recent thing. I really don't wanna switch back to Amazon music because of these horrible issues",
    "rate": "1",
    "date": "March 14, 2024"
  }
]